# Python for Spatial Analysis
## Second part of the module of GG3209 Spatial Analysis with GIS.
### Notebook to learn and practice Pandas

---
Dr Fernando Benitez -  University of St Andrews - School of Geography and Sustainable Development - First Iteration 2023 v.1.0

### Introduction 

After practicing **NumPy**, this notebook aims to work with the library **Pandas** which allows for reading in and working with data tables.

Most geo spatial scientists are first introduced to data tables in the form of an Excel Spreadsheet. In such a structure, each record or feature is represented by a row of data while each column represents a specific piece of information for each record. Sometimes we call that a variable, or attribute. 

Further, spreadsheets are able to hold different data types in each column. A comparable data structure would be handy for use in Python. This is made available by the **Pandas** library. Pandas allows for data to be stored in **DataFrames**. If you work in the R environment, this is very similar to the concept of data frames in R. In fact, *Pandas DataFrames were inspired by R data frames*. 

Pandas makes use of the NumPy library, so it is generally a good idea to import NumPy if you plan to use Pandas. Also, you will need to install Pandas and NumPy into your environment prior to using them., but we have include both libraries in our python environment py4sa.yml

The complete documentation for Pandas can be found [here](https://pandas.pydata.org/).

After working through this module you will be able to:

1. Create and manipulate **Series** and **DataFrames** using Pandas.
2. Query and subset DataFrames.
3. Manipulate DataFrames.
4. Summarize and group DataFrames.

## Pandas

### Intro to Series

In [1]:
import numpy as np
import pandas as pd

Before we talk about DataFrames, I will introduce the concept of a **Series**. These are actually very similar to a NumPy array except that they allow for axis labels to be assigned. Examples of generating a series from **lists**, **NumPy arrays**, and **dictionaries** are provided below. 

A series is comparable to a single column from a Spreadsheet.

In [2]:
lst1 = ["GIS", "Remote Sensing", "Spatial Analysis", "Digital Cartography"]
arr1 = np.array([350, 455, 457, 642])
dict1 = {'Class1':"GIS", "Class2":"Remote Sensing", "Class3":"Spatial Analysis", "Class4":"Digital Cartography"}

s_lst = pd.Series(data=lst1, index = ["Class1", "Class2", "Class3", "Class4"])
s_arr = pd.Series(data=arr1, index = ["Class1", "Class2", "Class3", "Class4"])
s_dict = pd.Series(dict1)

print(s_lst)
print(s_arr)
print(s_dict)

Class1                    GIS
Class2         Remote Sensing
Class3       Spatial Analysis
Class4    Digital Cartography
dtype: object
Class1    350
Class2    455
Class3    457
Class4    642
dtype: int64
Class1                    GIS
Class2         Remote Sensing
Class3       Spatial Analysis
Class4    Digital Cartography
dtype: object

Labels or names can then be used to select data either using **bracket notation** or **dot notation**. 

You can use whichever method you prefer. However, if you use dot notation you should not included spaces in the column names.

In [3]:
print(s_dict["Class3"])
print(s_dict.Class3)

Spatial Analysis
Spatial Analysis

## Intro to DataFrames

Let's start by building a DataFrame from a set of lists. First, you can create three lists to hold different components of course title information.

Next, you could combine these lists into a dictionary. Finally, you can convert the dictionary into a DataFrame. 

Note that a well formatted table is generated by just calling the DataFrame name without the *print()* function; however, in the example we use *print()* (but try out both ways to see the difference). Also, the **keys** from the dictionary have been used as the column names, and a default index has been assigned to each row.

In [4]:
prefix = ["Geol", "Geol", "Geol", "Geol", "Geog", "Geog", "Geog"]
cnum = [103, 321, 331, 341, 350, 455, 462]
cname = ["Earth Through Time", "Geomorphology", "Paleontology", "Structural Geology", "GIScience", "Remote Sensing", "Digital Cartography"]
course_dict = {"prefix": prefix, "course_number": cnum, "course_name": cname}
course_df = pd.DataFrame(course_dict)
#course_df
print(course_df)

  prefix  course_number          course_name
0   Geol            103   Earth Through Time
1   Geol            321        Geomorphology
2   Geol            331         Paleontology
3   Geol            341   Structural Geology
4   Geog            350            GIScience
5   Geog            455       Remote Sensing
6   Geog            462  Digital Cartography

Since column names are assigned, they can be used to select out individual columns using bracket or dot notation. Single columns can be saved as a Series.

In [6]:
print(course_df["course_name"])
# Or course_df.course_name

0     Earth Through Time
1          Geomorphology
2           Paleontology
3     Structural Geology
4              GIScience
5         Remote Sensing
6    Digital Cartography
Name: course_name, dtype: object

A list of column names can be provided to subset out multiple columns.

In [7]:
print(course_df[["course_number", "course_name"]])

   course_number          course_name
0            103   Earth Through Time
1            321        Geomorphology
2            331         Paleontology
3            341   Structural Geology
4            350            GIScience
5            455       Remote Sensing
6            462  Digital Cartography

## Indexing with ```.loc``` and ```.iloc```

Pandas created the methods **.loc[]** and **.iloc[]** as more flexible alternatives for accessing data from a dataframe. 

Use ```df.iloc[]``` for indexing with integers and ```df.loc[]``` for indexing with labels.

These are typically the recommended methods of indexing in Pandas

1. Using the **.loc** method, you can subset based on **column names and row labels** combined, and 

2. The **.iloc** method, in contrast, is used for **selection based on indexes**.

In [8]:
print(course_df.loc[[1, 2, 4],["course_number", "course_name"]])
# Or course_df.iloc[[1, 2, 4],[1, 2]]

   course_number    course_name
1            321  Geomorphology
2            331   Paleontology
4            350      GIScience

You can even use the data stored in existing columns to create a new column. Note that the new column does not need to be declared prior to writing to it. In the example, I have written the entire course name to a new column. The *map()* method is used to make sure all data are treated as strings. It allow for the same function, in this case **str()**, to be applied to each element in an iterable, in this case each row in the DataFrame. I am including blank spaces so that the components are not ran together.

In [9]:
course_df["full_name"] = course_df["prefix"].map(str)  + " " + course_df["course_number"].map(str)  + ": " + course_df["course_name"].map(str) 
print(course_df)

  prefix  course_number          course_name                      full_name
0   Geol            103   Earth Through Time   Geol 103: Earth Through Time
1   Geol            321        Geomorphology        Geol 321: Geomorphology
2   Geol            331         Paleontology         Geol 331: Paleontology
3   Geol            341   Structural Geology   Geol 341: Structural Geology
4   Geog            350            GIScience            Geog 350: GIScience
5   Geog            455       Remote Sensing       Geog 455: Remote Sensing
6   Geog            462  Digital Cartography  Geog 462: Digital Cartography

## Reading external files

Instead of creating data tables or DataFrames manually, you are probably more likely to read in a data table from a file (CSV) or web link. 

Fortunately, **Pandas** provides functions for reading data in from a variety of formats. Here are some examples:

* *read_table()*: delimited file (TXT, CSV, etc.)
* *read_csv()*: comma-separated values (CSV)
* *read_excel()*: Excel Spreadsheet
* *read_json()*: JavaScript Object Notation (JSON)
* *read_html()*: HTML table
* *read_sas()*: SAS file

Full documentation on reading in data can be found [here](https://pandas.pydata.org/docs/reference/io.html).

In the example below, I am reading in a CSV file from my local computer. The *sep* argument is used to define the deliminator ( like you have done in Excel).

However, commas are the default, so *it isn't necessary to include this argument in this case*.

Setting the *header* argument to 0 indicated that the first row of data should be treated as column names or headers. 

It isn't always necessary to specify the character encoding; But a best practice tells that it is necessary due to the use of special characters in some tables. 

To view the first 10 rows of the data. You can use the *head()* method.

The *len()* function returns the number of rows.

In [13]:
cities_df = pd.read_csv("data/world_cities.csv", sep=",", header=0, encoding="ISO-8859-1")
cities_df.head(10)

                 city       country    pop    lat    lon  capital
0  'Abasan al-Jadidah     Palestine   5629  31.31  34.34        0
1  'Abasan al-Kabirah     Palestine  18999  31.32  34.35        0
2        'Abdul Hakim      Pakistan  47788  30.55  72.11        0
3  'Abdullah-as-Salam        Kuwait  21817  29.36  47.98        0
4               'Abud     Palestine   2456  32.03  35.07        0
5             'Abwein     Palestine   3434  32.03  35.20        0
6            'Adadlay       Somalia   9198   9.77  44.65        0
7              'Adale       Somalia   5492   2.75  46.30        0
8               'Afak          Iraq  22706  32.07  45.26        0
9               'Afif  Saudi Arabia  41731  23.92  42.93        0

In [11]:
print(len(cities_df))

43645

## DataFrame Query and Subset

Let's now use this data table to explore data query and selection methods. 

In the first example, I am selecting out Italian cities and saving them to a new DataFrame. Note the use of bracket notation. The code in the middle bracket is used to perform the selection. 

The second example includes a compound query. Note the use of parenthesis within the query. 

Lastly, it is also possible to subset out only certain columns that meet the query. In the last example, I am subsetting out just the name of the city and population.

In [14]:
#Example 1
just_italy = cities_df[cities_df["country"]=="Italy"]
print(just_italy.head(10))
print('')
print(len(just_italy))
print('')
#Example 2
italy_med_cities = cities_df[(cities_df["country"]=="Italy") & (cities_df["pop"]>500000)]
print(italy_med_cities)
print('')
print(len(italy_med_cities))
print('')
#Example 3
italy_cities_pop = cities_df[(cities_df["country"]=="Italy") & (cities_df["pop"]>500000)][["city", "pop"]]
print(italy_cities_pop.head(3))
print('')

                      city country    pop    lat    lon  capital
181            Abano Terme   Italy  19167  45.35  11.78        0
197          Abbiategrasso   Italy  30515  45.41   8.91        0
310                 Acerra   Italy  51394  41.00  14.39        0
329           Aci Castello   Italy  17930  37.56  15.13        0
330             Aci Catena   Italy  28459  37.60  15.14        0
331       Aci Sant'Antonio   Italy  17566  37.60  15.11        0
335               Acireale   Italy  53476  37.62  15.17        0
344  Acquaviva delle Fonti   Italy  21555  40.89  16.84        0
345            Acqui Terme   Italy  20634  44.68   8.46        0
346                   Acri   Italy  21484  39.49  16.38        0

985

          city country      pop    lat    lon  capital
12392    Genoa   Italy   599064  44.42   8.93        0
23820    Milan   Italy  1316218  45.48   9.19        0
25403   Naples   Italy   983614  40.85  14.27        0
27926  Palermo   Italy   668275  38.12  13.36        0
31558     Rome   Italy  2561181  41.89  12.50        1
39214    Turin   Italy   873123  45.08   7.68        0

6

         city      pop
12392   Genoa   599064
23820   Milan  1316218
25403  Naples   983614

Another option for performing queries is to use the **query()** method provided by Pandas. When using this method, the query will need to be provided as an expression in string form. Also, spaces in column names can be problematic, so spaces should be removed or replaced with underscores.

In [15]:
#Remove spaces in column names using list comprehension
cities_df.columns = [column.replace(" ", "_") for column in cities_df.columns]
#Example 1
just_spain = cities_df.query('country=="Spain"')
print(just_spain.head(10))
print('')
print(len(just_spain))
print('')
#Example 2
spanish_cities_df = cities_df.query('country=="Spain" and pop > 500000')
print(len(spanish_cities_df))
print('')
#Example 3
subset_query = cities_df.query('country=="Spain" and pop > 500000')[["city", "pop"]]
print(subset_query)
print('')

                       city country     pop    lat   lon  capital
127                A Coruna   Spain  243088  43.33 -8.42        0
128               A Estrada   Spain   21997  42.70 -8.50        0
129               A Laracha   Spain   10856  43.25 -8.59        0
130    A Pobra do Caraminal   Spain    9955  42.61 -8.94        0
182         Abanto Zierbena   Spain    9505  43.32 -3.08        0
185                  Abaran   Spain   12890  38.20 -1.40        0
253                  Abrera   Spain    9966  41.52  1.90        0
413                    Adra   Spain   22900  36.76 -3.02        0
573       Aguilar de Campoo   Spain    7224  42.80 -4.27        0
574  Aguilar de la Frontera   Spain   13502  37.52 -4.65        0

864

6

            city      pop
3385   Barcelona  1591485
22032     Madrid  3146804
22302     Malaga   553916
34629    Sevilla   702516
39931   Valencia   803438
42691   Zaragoza   658186

Once a query is complete, you may want to save the result back to a file on your local machine. The code below provides an example for saving out the last subset of data to a CSV file. The Pandas documentation provides examples for saving to other formats.

In [16]:
subset_query.to_csv("data/subset_data.csv", sep=",", header=True)

## Missing Values

The *NULL*, *NoData*, or missing indicator in Python is *NaN*. To begin exploring missing values, let's recode some of the data to *NaN* in the cities data set. In the example below, I am changing the "Germany" and "Palestine" countries to *NaN*. I am also recoding any population between 10.000 and 50.000 to *NaN*. The *replace()* method is used to change the categories while the *mask()* method is used to recode the rating values. *np.nan* is a NumPy method for defining null values.

In [17]:
cities_nan = cities_df.copy()
cities_nan["country"] = cities_nan[["country"]].replace(["Germany", "Palestine"], np.nan)
cities_nan['pop'].mask(cities_nan['pop'].between(10000, 50000), inplace=True)
print(cities_nan.head(10))
print('')
print(len(cities_nan))

                 city       country     pop    lat    lon  capital
0  'Abasan al-Jadidah           NaN  5629.0  31.31  34.34        0
1  'Abasan al-Kabirah           NaN     NaN  31.32  34.35        0
2        'Abdul Hakim      Pakistan     NaN  30.55  72.11        0
3  'Abdullah-as-Salam        Kuwait     NaN  29.36  47.98        0
4               'Abud           NaN  2456.0  32.03  35.07        0
5             'Abwein           NaN  3434.0  32.03  35.20        0
6            'Adadlay       Somalia  9198.0   9.77  44.65        0
7              'Adale       Somalia  5492.0   2.75  46.30        0
8               'Afak          Iraq     NaN  32.07  45.26        0
9               'Afif  Saudi Arabia     NaN  23.92  42.93        0

43645

The *dropna()* method can be used to remove rows or columns that contain missing data. If the axis parameter is set to 0, rows with missing values in any column will be removed. If it is set to 1, columns with missing data in any row will be removed.

In [18]:
cities_drop = cities_nan.dropna(axis=0)
print(cities_drop.head(10))
print('')
print(len(cities_drop))
print('')
cities_dropc = cities_nan.dropna(axis=1)
print(cities_dropc.head(10))
print('')
print(len(cities_dropc))
print('')

        city               country        pop    lat    lon  capital
6   'Adadlay               Somalia     9198.0   9.77  44.65        0
7     'Adale               Somalia     5492.0   2.75  46.30        0
10    'Afrin                 Syria    51139.0  36.51  36.87        0
14    'Ajlun                Jordan     8629.0  32.34  35.74        0
15    'Ajman  United Arab Emirates   238605.0  25.42  55.43        0
17    'Al'al                Jordan     4526.0  32.63  35.90        0
20      'Ali               Bahrain    57024.0  26.15  50.53        0
24    'Alula               Somalia     5158.0  11.97  50.76        0
25    'Amman                Jordan  1303197.0  31.95  35.93        1
48     'Ataq                 Yemen     2982.0  14.55  46.88        0

27875

                 city    lat    lon  capital
0  'Abasan al-Jadidah  31.31  34.34        0
1  'Abasan al-Kabirah  31.32  34.35        0
2        'Abdul Hakim  30.55  72.11        0
3  'Abdullah-as-Salam  29.36  47.98        0
4               'Abud  32.03  35.07        0
5             'Abwein  32.03  35.20        0
6            'Adadlay   9.77  44.65        0
7              'Adale   2.75  46.30        0
8               'Afak  32.07  45.26        0
9               'Afif  23.92  42.93        0

43645

The *.fillna()* method can be used to replace NA values with another value or string. In the example, I am changing the missing genres to "Unknown Country".

In [19]:
cities_nan["country"] = cities_nan["country"].fillna(value="Unknown Country")
print(cities_nan.head(10))

                 city          country     pop    lat    lon  capital
0  'Abasan al-Jadidah  Unknown Country  5629.0  31.31  34.34        0
1  'Abasan al-Kabirah  Unknown Country     NaN  31.32  34.35        0
2        'Abdul Hakim         Pakistan     NaN  30.55  72.11        0
3  'Abdullah-as-Salam           Kuwait     NaN  29.36  47.98        0
4               'Abud  Unknown Country  2456.0  32.03  35.07        0
5             'Abwein  Unknown Country  3434.0  32.03  35.20        0
6            'Adadlay          Somalia  9198.0   9.77  44.65        0
7              'Adale          Somalia  5492.0   2.75  46.30        0
8               'Afak             Iraq     NaN  32.07  45.26        0
9               'Afif     Saudi Arabia     NaN  23.92  42.93        0

It is also possible to replace null values with a statistic derived from the available values. In the example, I am replacing the missing population values with the mean of all available in the attribute. Of course this is not possible, here is just an example.

In [20]:
cities_nan["pop"] = cities_nan["pop"].fillna(value=cities_nan["pop"].mean())
print(cities_nan.head(10))

                 city          country           pop    lat    lon  capital
0  'Abasan al-Jadidah  Unknown Country   5629.000000  31.31  34.34        0
1  'Abasan al-Kabirah  Unknown Country  76436.042558  31.32  34.35        0
2        'Abdul Hakim         Pakistan  76436.042558  30.55  72.11        0
3  'Abdullah-as-Salam           Kuwait  76436.042558  29.36  47.98        0
4               'Abud  Unknown Country   2456.000000  32.03  35.07        0
5             'Abwein  Unknown Country   3434.000000  32.03  35.20        0
6            'Adadlay          Somalia   9198.000000   9.77  44.65        0
7              'Adale          Somalia   5492.000000   2.75  46.30        0
8               'Afak             Iraq  76436.042558  32.07  45.26        0
9               'Afif     Saudi Arabia  76436.042558  23.92  42.93        0

## Grouping and Summarizing DataFrames

Pandas provides methods for summarizing data as described in the examples below. First, I am creating individual statistics and saving them to variables. I then create a Series from a dictionary of these statistics, convert it to a DataFrame using the *to_frame()* method, then transpose the DataFrame using *transpose()*.

In [21]:
earthquake_df = pd.read_csv("data/Latest_earthquake_world.csv", sep=",", header=0, encoding="ISO-8859-1")
earthquake_df.head(5)

,time,latitude,longitude,depth,mag,magType,nst,gap,dmin,rms,...,updated,place,type,horizontalError,depthError,magError,magNst,status,locationSource,magSource
0,2023-02-23T08:01:02.881Z,38.1280,73.2184,10.000,4.70,mb,75.0,55.0,1.7450,0.66,...,2023-02-23T08:35:43.040Z,"65 km W of Murghob, Tajikistan",earthquake,4.00,1.907,0.058,91.0,reviewed,us,us
1,2023-02-23T06:55:34.020Z,18.7946,-63.9205,10.000,3.67,md,19.0,228.0,1.1264,0.50,...,2023-02-23T08:02:57.172Z,Leeward Islands,earthquake,5.27,4.420,0.130,14.0,reviewed,pr,pr
2,2023-02-23T06:50:49.137Z,38.4879,72.8122,10.000,4.50,mb,21.0,171.0,1.2640,0.56,...,2023-02-23T07:28:35.040Z,"106 km WNW of Murghob, Tajikistan",earthquake,8.00,2.000,0.140,15.0,reviewed,us,us
3,2023-02-23T06:18:13.280Z,-8.5483,-77.6254,66.540,4.70,mb,44.0,154.0,3.5030,0.47,...,2023-02-23T07:15:40.040Z,"22 km SW of Quiches, Peru",earthquake,8.10,8.700,0.064,74.0,reviewed,us,us
4,2023-02-23T03:36:09.429Z,-18.2870,-177.8261,524.983,4.90,mb,40.0,63.0,3.6260,0.67,...,2023-02-23T03:50:54.040Z,NaN,earthquake,13.43,10.963,0.108,27.0,reviewed,us,us

In [22]:
earthquake_df = pd.read_csv("data/Latest_earthquake_world.csv", sep=",", header=0, encoding="ISO-8859-1")
earthquake_df.columns = [column.replace(" ", "_") for column in earthquake_df.columns]
earth_cnt = earthquake_df["mag"].count()
earth_mn = earthquake_df["mag"].mean()
earth_max = earthquake_df["mag"].max()
earth_min = earthquake_df["mag"].min()
earth_rang = earth_max-earth_min
earth_stats= pd.Series({"Count": earth_cnt, "Mean": earth_mn, "Max": earth_max, "Min": earth_min, "Range": earth_rang}).to_frame().transpose()
print(earth_stats)

   Count      Mean  Max  Min  Range
0  337.0  3.942077  6.8  2.5    4.3

It is also possible to obtain summary statistics for each group separately by applying the very useful *group_by()* method. In the example below, I am obtaining stats for each MagSource and saving them into a DataFrame. The columns do not need to be defined beforehand.

In [23]:
earthquake_df = pd.read_csv("data/Latest_earthquake_world.csv", sep=",", header=0, encoding="ISO-8859-1")
earthquake_df.columns = [column.replace(" ", "_") for column in earthquake_df.columns]
earthquake_stats = pd.DataFrame()
earthquake_stats["Count"] = earthquake_df.groupby("magSource")['mag'].count()
earthquake_stats["Mean"] = earthquake_df.groupby("magSource")['mag'].mean()
earthquake_stats["Max"] = earthquake_df.groupby("magSource")['mag'].max()
earthquake_stats["Min"] = earthquake_df.groupby("magSource")['mag'].min()
earthquake_stats["Range"] = earthquake_stats["Max"] - earthquake_stats["Min"]
earthquake_stats

           Count      Mean   Max   Min  Range
magSource
ak            37  3.075676  5.40  2.50   2.90
av             3  2.836667  2.95  2.63   0.32
ci             2  2.850000  2.90  2.80   0.10
guc            3  4.600000  4.90  4.40   0.50
hv            13  2.753077  3.24  2.54   0.70
nc            10  2.776000  3.22  2.52   0.70
nn             2  3.100000  3.50  2.70   0.80
ok             2  2.835000  3.11  2.56   0.55
pr            33  3.076364  3.87  2.53   1.34
se             2  2.570000  2.61  2.53   0.08
tx            19  3.047368  4.70  2.50   2.20
us           209  4.500478  6.80  2.60   4.20
uu             2  3.045000  3.17  2.92   0.25

The *describe()* method can be used to obtain a set of default summary statistics for a column of data. Combining this with *group_by()* allows for the calculation of statistics by group.

In [24]:
print(earthquake_df.groupby("mag")["depth"].describe())

      count       mean        std        min        25%        50%  \
mag
2.50   11.0  39.211561  73.200140   2.000000   7.117415  11.200000
2.52    1.0   4.410000        NaN   4.410000   4.410000   4.410000
2.53    2.0   7.890000   6.420530   3.350000   5.620000   7.890000
2.54    1.0  30.959999        NaN  30.959999  30.959999  30.959999
2.54    2.0  11.120000   0.579828  10.710000  10.915000  11.120000
...     ...        ...        ...        ...        ...        ...
5.60    2.0  80.423000  62.782597  36.029000  58.226000  80.423000
5.70    1.0  20.395000        NaN  20.395000  20.395000  20.395000
6.10    1.0  38.615000        NaN  38.615000  38.615000  38.615000
6.30    1.0  16.000000        NaN  16.000000  16.000000  16.000000
6.80    1.0  20.522000        NaN  20.522000  20.522000  20.522000

             75%         max
mag
2.50   25.250000  250.000000
2.52    4.410000    4.410000
2.53   10.160000   12.430000
2.54   30.959999   30.959999
2.54   11.325000   11.530000
...          ...         ...
5.60  102.620000  124.817000
5.70   20.395000   20.395000
6.10   38.615000   38.615000
6.30   16.000000   16.000000
6.80   20.522000   20.522000

[79 rows x 8 columns]

## Concatenate and Merge

The Pandas *concat()* method is used to **concatenate** DataFrames that have the same columns. This is comparable to copying and pasting rows from two spreadsheets into a new spreadsheet. To demonstrate this, I have extracted rows using indexes. Next, I concatenate them back to a new DataFrame.

In [25]:
earthquake_df = pd.read_csv("data/Latest_earthquake_world.csv", sep=",", header=0, encoding="ISO-8859-1")
earthquake_df.columns =[column.replace(" ", "_") for column in earthquake_df.columns]

earth_sub1 = earthquake_df[100:500]
earth_sub2 = earthquake_df[900:1300]
earth_subc = pd.concat([earth_sub1, earth_sub2])
print(len(earthquake_df))
print(len(earth_subc))

337
237

**Merge** is comparable to table joins when using SQL. This requires the use of **keys** and the declaration of a joining method, such as "Left", "Right", "Inner", or "Outer". 

In the example, I first create a unique ID by copying the row index to a column (idx).

I then break the data into two components, each containing the ID and a subset of the remaining columns. 

I then use the *merge()* method to merge the DataFrames using the "inner" method and the common "id" field. "Inner" will only return rows that occur in both data sets. Since both DataFrames were derived from the same original DataFrame, they will have identical rows, so the result would be the same as using "left", where all rows from the left table are maintained even if they don't occur in the right table, or "right", where all rows from the right table are maintained even if they don't occur in the left table. 

In the second example, I use a query to separate out only earthquakes with magnitude of more than 4.0. When I perform a join with all of the data using the "inner" method, I only get back the common or shared rows. 

Note that there is also a *join()* method that joins based on indexes. However, that will not be demonstrated here.

In [26]:
earthquake_df = pd.read_csv("data/Latest_earthquake_world.csv", sep=",", header=0, encoding="ISO-8859-1")

earthquake_df["idx"] = earthquake_df.index
print(earthquake_df.head(2))
print('')
print(len(earthquake_df))
print('')
subset_first = earthquake_df[["idx", "mag"]]
subset_second = earthquake_df[["idx", "depth", "place"]]

earth_merge = pd.merge(subset_first, subset_second, how="inner", on="idx")
print(earth_merge.head(5))
print('')
print(len(earth_merge))
print('')
subset_third = earthquake_df.query('mag > 4')[["idx", "place", "depth"]]
earth_merge2 = pd.merge(subset_first, subset_third, how="inner", on="idx")
print(earth_merge2.head(5))
print('')
print(len(earth_merge2))
print('')

                       time  latitude  longitude  depth   mag magType   nst  \
0  2023-02-23T08:01:02.881Z   38.1280    73.2184   10.0  4.70      mb  75.0
1  2023-02-23T06:55:34.020Z   18.7946   -63.9205   10.0  3.67      md  19.0

     gap    dmin   rms  ...                           place        type  \
0   55.0  1.7450  0.66  ...  65 km W of Murghob, Tajikistan  earthquake
1  228.0  1.1264  0.50  ...                 Leeward Islands  earthquake

  horizontalError depthError magError  magNst    status  locationSource  \
0            4.00      1.907    0.058    91.0  reviewed              us
1            5.27      4.420    0.130    14.0  reviewed              pr

   magSource idx
0         us   0
1         pr   1

[2 rows x 23 columns]

337

   idx   mag    depth                              place
0    0  4.70   10.000     65 km W of Murghob, Tajikistan
1    1  3.67   10.000                    Leeward Islands
2    2  4.50   10.000  106 km WNW of Murghob, Tajikistan
3    3  4.70   66.540          22 km SW of Quiches, Peru
4    4  4.90  524.983                                NaN

337

   idx  mag                              place    depth
0    0  4.7     65 km W of Murghob, Tajikistan   10.000
1    2  4.5  106 km WNW of Murghob, Tajikistan   10.000
2    3  4.7          22 km SW of Quiches, Peru   66.540
3    4  4.9                                NaN  524.983
4    5  4.4         52 km WNW of Ovalle, Chile   34.097

192

## Final remarks

Well there is much to discuss and learn from the use of Pandas, but this is the initial step to get you familiarize with this library. Now it is your turn to try out the exercises to help you to recall and apply all the methods in these two notebook. So please open the **Exercises_NumPy_Pandas.ipynb** work on it. 

For more examples and details, please consult the documentation for [Pandas](https://pandas.pydata.org/docs/reference/io.html). 

In the next week, we will discuss methods for graphing and visualizing data using **matplotlib**, and **Pandas**.